results/bdev_sqpoll2/ndev1/003_fio/cmd_54.output
io_uring-bdev_xnvme: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=spdk_bdev, iodepth=128
fio-3.32-75-gc470
Starting 1 thread
{
  "fio version" : "fio-3.32-75-gc470",
  "timestamp" : 1667197055,
  "timestamp_ms" : 1667197055220,
  "time" : "Mon Oct 31 01:17:35 2022",
  "jobs" : [
    {
      "jobname" : "io_uring-bdev_xnvme",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring-bdev_xnvme",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "128",
        "bs" : "512",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "spdk_bdev",
        "spdk_conf" : "/tmp/spdk_bdev_xnvme_io_uring.conf",
        "filename" : "Nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 3356144128,
        "io_kbytes" : 3277484,
        "bw_bytes" : 479380678,
        "bw" : 468145,
        "iops" : 936272.103985,
        "runtime" : 7001,
        "total_ios" : 6554841,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 674,
          "max" : 16949,
          "mean" : 821.569046,
          "stddev" : 880.959230,
          "N" : 6554842
        },
        "clat_ns" : {
          "min" : 10299,
          "max" : 160169,
          "mean" : 135722.460535,
          "stddev" : 3019.100674,
          "N" : 6554968,
          "percentile" : {
            "1.000000" : 132096,
            "5.000000" : 132096,
            "10.000000" : 132096,
            "20.000000" : 134144,
            "30.000000" : 134144,
            "40.000000" : 134144,
            "50.000000" : 136192,
            "60.000000" : 136192,
            "70.000000" : 136192,
            "80.000000" : 136192,
            "90.000000" : 138240,
            "95.000000" : 142336,
            "99.000000" : 146432,
            "99.500000" : 146432,
            "99.900000" : 148480,
            "99.950000" : 148480,
            "99.990000" : 150528
          }
        },
        "lat_ns" : {
          "min" : 11038,
          "max" : 160952,
          "mean" : 136544.029468,
          "stddev" : 3139.624149,
          "N" : 6554968
        },
        "bw_min" : 467876,
        "bw_max" : 468760,
        "bw_agg" : 100.000000,
        "bw_mean" : 468361.785714,
        "bw_dev" : 254.810089,
        "bw_samples" : 14,
        "iops_min" : 935752,
        "iops_max" : 937521,
        "iops_mean" : 936723.714286,
        "iops_stddev" : 509.779806,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 35.700000,
      "sys_cpu" : 64.285714,
      "ctx" : 13,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 100.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999992,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.100000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.010000,
        "50" : 0.010000,
        "100" : 0.010000,
        "250" : 100.000717,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

io_uring-bdev_xnvme: (groupid=0, jobs=1): err= 0: pid=62771: Mon Oct 31 01:17:35 2022
  read: IOPS=936k, BW=457MiB/s (479MB/s)(3201MiB/7001msec)
    slat (nsec): min=674, max=16949, avg=821.57, stdev=880.96
    clat (usec): min=10, max=160, avg=135.72, stdev= 3.02
     lat (usec): min=11, max=160, avg=136.54, stdev= 3.14
    clat percentiles (usec):
     |  1.00th=[  133],  5.00th=[  133], 10.00th=[  133], 20.00th=[  135],
     | 30.00th=[  135], 40.00th=[  135], 50.00th=[  137], 60.00th=[  137],
     | 70.00th=[  137], 80.00th=[  137], 90.00th=[  139], 95.00th=[  143],
     | 99.00th=[  147], 99.50th=[  147], 99.90th=[  149], 99.95th=[  149],
     | 99.99th=[  151]
   bw (  KiB/s): min=467876, max=468760, per=100.00%, avg=468361.79, stdev=254.81, samples=14
   iops        : min=935752, max=937521, avg=936723.71, stdev=509.78, samples=14
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=100.00%
  cpu          : usr=35.70%, sys=64.29%, ctx=13, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=6554841,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=457MiB/s (479MB/s), 457MiB/s-457MiB/s (479MB/s-479MB/s), io=3201MiB (3356MB), run=7001-7001msec